# SQL for Analyst 2 - Query

In [1]:
# set MySQL URL
user = "dz3vg"
password = ""
host = "localhost"
port = 3306
dbname = "dataapplab_db"
with open("MySQL.key", "r") as file:
    password = file.read()
connection_string = f"mysql+mysqlconnector://{user}:{password}@{host}:{port}/{dbname}"

# connect to MySQL server
%load_ext sql
%sql $connection_string

# clean password
password = ""
connection_string = ""

In [2]:
%sql use dalba;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
0 rows affected.

[]

In [3]:
%%sql

select
    *
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [4]:
%%sql

select
    product_name, price as unit_price
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[('XiangLaJiTuiBaoRenQiCanA', Decimal('36.00')),
 ('HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00')),
 ('XiaRiBinFenTong', Decimal('88.00')),
 ('XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00')),
 ('GuoQiTaoCan', Decimal('999.00')),
 ('ChaoJiTaKeWuCanTaoCan', Decimal('27.00'))]

In [5]:
%%sql

select
    distinct sales_status
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[('NEW',), ('DEPRECATED',)]

In [6]:
%%sql

select
    product_id, product_name, price
from
    products
limit 4
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
4 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00')),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00')),
 (3, 'XiaRiBinFenTong', Decimal('88.00')),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'))]

In [7]:
%%sql

select
    product_id, product_name, price, now() as created_time
from
    products
limit 6
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00'), datetime.datetime(2020, 8, 14, 0, 56, 41)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'), datetime.datetime(2020, 8, 14, 0, 56, 41)),
 (3, 'XiaRiBinFenTong', Decimal('88.00'), datetime.datetime(2020, 8, 14, 0, 56, 41)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'), datetime.datetime(2020, 8, 14, 0, 56, 41)),
 (5, 'GuoQiTaoCan', Decimal('999.00'), datetime.datetime(2020, 8, 14, 0, 56, 41)),
 (6, 'ChaoJiTaKeWuCanTaoCan', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 56, 41))]

In [8]:
%%sql

select
    *
from
    products
limit 3
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [9]:
%%sql

select
    *
from
    products
limit 3, 1
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [10]:
%%sql

select
    *
from
    products
limit 3, 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [11]:
%%sql

select
    *
from
    products
limit 3, 3
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [12]:
%%sql

select
    price
from
    products
order by price
limit 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(Decimal('27.00'),), (Decimal('36.00'),)]

In [13]:
%%sql

select
    *
from
    products
order by create_date, price
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [14]:
%%sql

select
    *
from
    products
where
    product_id = 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20))]

In [15]:
%%sql

select
    *
from
    products
where
    product_name = 'ChaoJiTaKeWuCanTaoCan'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [16]:
%%sql

select
    *
from
    products
where
    product_name like 'ChaoJiTa%'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [17]:
%%sql

select
    *
from
    products
where
    product_name like '%TaKe%'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [18]:
%%sql

select
    *
from
    products
where
    product_name <> 'ChaoJiTaKeWuCanTaoCan'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [19]:
%%sql

select
    *
from
    products
where
    product_name not like '%TaKe%'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [20]:
%%sql

select
    *
from
    products
where
    price > 60
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [21]:
%%sql

select
    *
from
    products
where
    price between 30 and 40
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [22]:
%%sql

select
    *
from
    products
where
    price in (88, 27)
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [23]:
%%sql

select
    *
from
    products
where
    price = 88 or price = 27
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [24]:
%%sql

select
    *
from
    products
where
    create_date > "2016-06-20" and sales_status = "NEW"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
3 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [25]:
%%sql

select
    *
from
    products
where
    create_date > "2016-06-20" and sales_status <> "NEW"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [26]:
%%sql

select
    *
from
    products
where
    image_url is null
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27))]

In [27]:
%%sql

select
    *
from
    products
where
    image_url is not null
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
5 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20)),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20)),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20))]

In [28]:
%%sql

select
    *
from
    products
where
    product_name like "Xiang__JiTuiBao%"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20))]

In [29]:
%%sql

select
    *
from
    products
where
    product_name like "XiangLa%"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20))]

In [30]:
%%sql

select
    *
from
    products
where
    product_name like "%Tong"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [31]:
%%sql

select
    *
from
    products
where
    product_name like "_______________"
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [32]:
%%sql

select
    product_name, price, 
    price+10 as adjusted_price
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[('XiangLaJiTuiBaoRenQiCanA', Decimal('36.00'), Decimal('46.00')),
 ('HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'), Decimal('47.00')),
 ('XiaRiBinFenTong', Decimal('88.00'), Decimal('98.00')),
 ('XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'), Decimal('46.00')),
 ('GuoQiTaoCan', Decimal('999.00'), Decimal('1009.00')),
 ('ChaoJiTaKeWuCanTaoCan', Decimal('27.00'), Decimal('37.00'))]

In [33]:
%%sql

select
    *, 
    if(image_url is null, 'missing', image_url)
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20), 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg'),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20), ''),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20), ''),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20), ''),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20), ''),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27), 'missing')]

In [34]:
%%sql

select
    *, 
    (case
        when image_url is null then "missing"
        when image_url = "" then "missing"
        else image_url
    end) as url
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20), 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg'),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20), 'missing'),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20), 'missing'),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20), 'missing'),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20), 'missing'),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27), 'missing')]

In [35]:
%%sql

select
    *, 
    (case
        when price < 20 then "0-20"
        when price >= 20 and price < 30 then "20-30"
        when price >= 30 and price < 40 then "30-40"
        when price >= 40 and price < 50 then "40-50"
        else "price+"
    end) as price_group
from
    products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', 'http://img.mp.itc.cn/upload/20170424/4349e424649342c3b7227b5cde643902_th.jpeg', 'NEW', Decimal('36.00'), datetime.datetime(2014, 11, 20, 8, 20), '30-40'),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', '', 'NEW', Decimal('37.00'), datetime.datetime(2014, 12, 20, 8, 20), '30-40'),
 (3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20), 'price+'),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20), '30-40'),
 (5, 'GuoQiTaoCan', '', 'DEPRECATED', Decimal('999.00'), datetime.datetime(2018, 11, 20, 10, 20), 'price+'),
 (6, 'ChaoJiTaKeWuCanTaoCan', None, 'NEW', Decimal('27.00'), datetime.datetime(2020, 8, 14, 0, 14, 27), '20-30')]

In [36]:
%%sql

select
    *
from
    products
where
    product_id > 2
order by product_id
limit 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(3, 'XiaRiBinFenTong', '', 'NEW', Decimal('88.00'), datetime.datetime(2016, 11, 20, 10, 20)),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', '', 'NEW', Decimal('36.00'), datetime.datetime(2016, 11, 20, 10, 20))]

In [37]:
%%sql

select *
from
    (select
        product_id, product_name, price
    from
        products) as new_products
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
6 rows affected.

[(1, 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00')),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00')),
 (3, 'XiaRiBinFenTong', Decimal('88.00')),
 (4, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00')),
 (5, 'GuoQiTaoCan', Decimal('999.00')),
 (6, 'ChaoJiTaKeWuCanTaoCan', Decimal('27.00'))]

In [38]:
%%sql

select
    *
from
    orders
where
    create_date >= '2020-08-04'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
4 rows affected.

[(1, 'KFC123', 'joshua', 'XiangLaJiTuiBaoRenQiCanA', Decimal('36.00'), 1, 'CART', datetime.datetime(2020, 8, 10, 0, 14, 27)),
 (2, 'KFC321', 'joshua', 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'), 2, 'CART', datetime.datetime(2020, 8, 5, 0, 14, 27)),
 (5, 'KFC890', 'feng', 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'), 2, 'CART', datetime.datetime(2020, 8, 8, 0, 14, 27)),
 (6, 'KFC890', 'xiaowan', 'ChaoJiTaKeWuCanTaoCan', Decimal('29.00'), 1, 'CART', datetime.datetime(2020, 8, 5, 0, 14, 27))]

In [39]:
%%sql

select
    *
from
    orders
where
    create_date < '2020-08-04'
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(3, 'KFC234', 'jane', 'XiaRiBinFenTong', Decimal('88.00'), 1, 'CART', datetime.datetime(2020, 8, 3, 0, 14, 27)),
 (4, 'KFC567', 'peize', 'ChaoZhiQuanJiaTong', Decimal('85.00'), 3, 'CART', datetime.datetime(2020, 8, 2, 0, 14, 27))]

In [40]:
%%sql

select
    *
from
    orders
where
    unit_price > 26
order by unit_price
limit 2, 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(5, 'KFC890', 'feng', 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00'), 2, 'CART', datetime.datetime(2020, 8, 8, 0, 14, 27)),
 (2, 'KFC321', 'joshua', 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'), 2, 'CART', datetime.datetime(2020, 8, 5, 0, 14, 27))]

In [41]:
%%sql

select
    order_id, product_name, unit_price
from
    orders
where
    unit_price > 26
order by unit_price, product_name
limit 2, 2
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
2 rows affected.

[(5, 'XinAoErLiangKaoJiTuiBaoRenQiTaoCanB', Decimal('36.00')),
 (2, 'HaiTaiYanShaoDaJiTuiFanTaoCanA2', Decimal('37.00'))]

In [42]:
%%sql

select
    order_status, sum(unit_price * quantity) as total_amount
from
    orders
where
    unit_price > 26
group by order_status
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[('CART', Decimal('554.00'))]

In [43]:
%%sql

select
    *
from
    (select
        order_status, sum(unit_price * quantity) as total_amount
    from
        orders
    where
        unit_price > 26
    group by order_status) as new_orders
;

 * mysql+mysqlconnector://dz3vg:***@localhost:3306/dataapplab_db
1 rows affected.

[('CART', Decimal('554.00'))]

Note: Command Execution Order

1. select ... condition
2. from ...
3. where condition
4. order by ...
5. limit ...